app/views/quizzes/_answer_show_page.html.erb

<ol>
  <p>Categories: <% @quiz.categories.each do|category| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "quiz_categories" ON "categories"."id" = "quiz_categories"."category_id" WHERE "quiz_categories"."quiz_id" = ?  [["quiz_id", 1]]


<% @quiz.question_and_answers.each do |qa| %>
---
SELECT "question_and_answers".* FROM "question_and_answers" WHERE "question_and_answers"."quiz_id" = ?  [["quiz_id", 1]]