app/views/quizzes/_categories.html.erb

SELECT "categories".* FROM "categories"
---
Categories
<%= f.collection_check_boxes :category_ids, Category.all, :id, :name, class: "form-control" %></div>