app/views/quizzes/_comments.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."quiz_id" = ?  [["quiz_id", 2]]
---
<p><% @quiz.comments.each do |comment| %>