app/views/quizzes/_form.html.erb

SELECT "categories".* FROM "categories"
---
    Categories
    <%= f.collection_check_boxes :category_ids, Category.all, :id, :name, class: "form-control" %></div>

SELECT "question_and_answers".* FROM "question_and_answers" WHERE "question_and_answers"."quiz_id" = ?  [["quiz_id", 1]]
SELECT COUNT(*) FROM "question_and_answers" WHERE "question_and_answers"."quiz_id" = ?  [["quiz_id", 1]]
---
    <div class="form-group">
      <% if @quiz.question_and_answers.count != 5 %>
      <ol>
        <% current_quiz_count = @quiz.question_and_answers.count %>