app/views/quizzes/_form.html.erb

SELECT "categories".* FROM "categories"
---
    Categories
    <%= f.collection_check_boxes :category_ids, Category.all, :id, :name %>