app/views/quizzes/_questions_and_answers.html.erb

SELECT "question_and_answers".* FROM "question_and_answers" WHERE "question_and_answers"."quiz_id" = ?  [["quiz_id", 1]]
SELECT COUNT(*) FROM "question_and_answers" WHERE "question_and_answers"."quiz_id" = ?  [["quiz_id", 1]]
SELECT "question_and_answers".* FROM "question_and_answers" WHERE "question_and_answers"."quiz_id" = ?  [["quiz_id", 5]]
---
<div class="form-group">
  <% if @quiz.question_and_answers.count != 5 %>
  <ol>
    <% current_quiz_count = @quiz.question_and_answers.count %>