app/views/quizzes/_quiz_table.html.erb

SELECT  "games".* FROM "games" WHERE (quiz_id = 1) ORDER BY "games"."score" DESC LIMIT ?  [["LIMIT", 1]]
---
        <td><%= quiz.user.username %></td>
            <% if  Game.top_score(quiz).first %>
                        <!-- top score for game -->
              <td> <%= Game.top_score(quiz).first.score %></td>