app/views/quizzes/index.html.erb

               <% end  %></td>
              <% if  Game.top_score(quiz).first %>
              <td> <%= Game.top_score(quiz).first.score %></td>
---
SELECT  "games".* FROM "games" WHERE (quiz_id = 1) ORDER BY "games"."score" DESC LIMIT ?  [["LIMIT", 1]]