app/views/quizzes/show.html.erb

SELECT "games".* FROM "games" WHERE (quiz_id = 11)
---

Leader Board <% Game.top_5quiz_scores.each do |game| %>