app/views/quizzes/show.html.erb

  <ol>
 <p>Categories: <% @quiz.categories.each do|category| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "quiz_categories" ON "categories"."id" = "quiz_categories"."category_id" WHERE "quiz_categories"."quiz_id" = ?  [["quiz_id", 4]]

       <% end %></p>
  <% @quiz.question_and_answers.each do |qa| %>
---
SELECT "questions".* FROM "questions" WHERE "questions"."quiz_id" = ?  [["quiz_id", 8]]
SELECT "answers".* FROM "answers" WHERE "answers"."quiz_id" = ?  [["quiz_id", 8]]
SELECT "question_and_answers".* FROM "question_and_answers" WHERE "question_and_answers"."quiz_id" = ?  [["quiz_id", 4]]

 <% if @quiz.categories %>
 <p>Categories: <% @quiz.categories.each do|category| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "quiz_categories" ON "categories"."id" = "quiz_categories"."category_id" WHERE "quiz_categories"."quiz_id" = ?  [["quiz_id", 5]]


    <% Game.top_5_scores(quiz).each do |game| %>
---
SELECT "games".* FROM "games" WHERE (quiz_id = 11)


<p><% @quiz.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."quiz_id" = ?  [["quiz_id", 5]]