app/views/sessions/new.html.erb

SELECT "users".* FROM "users"
---
<%= form_tag(signin_path) do %>
<%= collection_select :user, :name, User.all, :name, :name, :include_blank => "select"   %>