app/views/users/_games_users_played.html.erb

SELECT "games".* FROM "games" WHERE "games"."user_id" = ?  [["user_id", 1]]
---
    <ol>
      <% @user.games.each do |game| %>