app/views/users/_quizzes_user_created.html.erb

SELECT "quizzes".* FROM "quizzes" WHERE "quizzes"."user_id" = ?  [["user_id", 1]]
---
    <ol>
      <% @user.quizzes.each do |quiz| %>

SELECT  "games".* FROM "games" WHERE (quiz_id = 1) ORDER BY "games"."score" DESC LIMIT ?  [["LIMIT", 1]]
---
    <td><%= link_to quiz.name, quiz_path(quiz) %></td>
      <% if Game.top_score(quiz).first  %>
      <td><%= Game.top_score(quiz).first.score %></td>