app/views/users/show.html.erb

    <ol>
      <% @user.games.each do |game| %>
---
SELECT "games".* FROM "games" WHERE "games"."user_id" = ?  [["user_id", 6]]

    <ol>
      <% @user.quizzes.each do |quiz| %>
---
SELECT "quizzes".* FROM "quizzes" INNER JOIN "comments" ON "quizzes"."id" = "comments"."quiz_id" WHERE "comments"."user_id" = ?  [["user_id", 6]]

    <td><%= link_to quiz.name, quiz_path(quiz) %></td>
      <% if Game.top_score(quiz).first  %>
      <td><%= Game.top_score(quiz).first.score %></td>
---
SELECT  "games".* FROM "games" WHERE (quiz_id = 1) ORDER BY "games"."score" DESC LIMIT ?  [["LIMIT", 1]]