app/views/games/new.html.erb

SELECT "question_and_answers".* FROM "question_and_answers" WHERE "question_and_answers"."quiz_id" = ?  [["quiz_id", 11]]
---
<%= f.hidden_field :quiz_id %>
<% @quiz.question_and_answers.each do |qa| %>