app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "sports"], ["LIMIT", 1]]
---
   def show
     category = Category.find_by_name(params[:category])