app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "user_id", "quiz_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "awesome!"], ["user_id", 1], ["quiz_id", 2], ["created_at", "2018-10-17 02:01:51.124742"], ["updated_at", "2018-10-17 02:01:51.124742"]]
---
  def create
    if params[:quiz_id]
     @quiz = Quiz.find(params[:quiz_id])
     @comment = @quiz.comments.build(comment_params)
     @comment.user = current_user
     @comment.save