app/controllers/games_controller.rb

    def create

      @game = Game.new(game_params)
      @game.user_id = current_user.id
      @game.save
---
INSERT INTO "games" ("user_id", "quiz_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 7], ["quiz_id", 1], ["created_at", "2018-10-12 15:20:13.970947"], ["updated_at", "2018-10-12 15:20:13.970947"]]

    def show
      @game = Game.find_by(id: params[:id])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]