app/controllers/games_controller.rb

UPDATE "games" SET "updated_at" = ?, "score" = ? WHERE "games"."id" = ?  [["updated_at", "2018-10-01 01:31:27.381656"], ["score", 1], ["id", 19]]
---
    def new
      @game = Game.new
      @quiz = Quiz.find_by(id: params[:quiz_id])
      #binding.pry
      @game.update(user_id:current_user.id, quiz_id: @quiz.id, guess: params[][:guess])