app/controllers/quizzes_controller.rb

  def destroy
    @quiz.destroy
    flash[:message]="Quiz deleted!"
    redirect_to user_path(User.find(session[:user_id]))
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]