app/controllers/sessions_controller.rb

  def facebook_login
      User.find_or_create_by(uid: auth_hash['uid']) do |u|
---
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", "10205273890324678"], ["LIMIT", 1]]