app/controllers/sessions_controller.rb

  def create
    if auth_hash
      @user = User.find_or_create_by(uid: auth_hash['uid']) do |u|
        u.username = auth_hash['info']['name']
        u.email = auth_hash['info']['email']
        u.image = auth_hash['info']['image']
        u.password = SecureRandom.hex
      end
    session[:user_id] = @user.id
    redirect_to @user
  else
    @user = User.find_by(username: params[:username])
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at", "uid", "image") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", "10205273890324678"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "81Jeremiah"], ["LIMIT", 1]]