app/models/game.rb

UPDATE "games" SET "updated_at" = ?, "score" = ? WHERE "games"."id" = ?  [["updated_at", "2018-10-06 17:26:29.793830"], ["score", 3], ["id", 24]]
---
  def self.play_game(game)
    #binding.pry
    game_score = (quiz.correct_answers & user_guesses).count
    game.score = game_score
    game.save

SELECT "guesses".* FROM "guesses" WHERE "guesses"."game_id" = ?  [["game_id", 25]]
---
  def user_guesses
    self.guesses.collect{|g| g.guess}