app/models/quiz.rb

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "sdasdasa"], ["created_at", "2018-10-16 15:55:41.134619"], ["updated_at", "2018-10-16 15:55:41.134619"]]
---
	def categories_attributes=(category_attributes)
    category_attributes.values.each do |category_attribute|
      if category_attribute[:name] != ""
        category = Category.find_or_create_by(category_attribute)

SELECT "question_and_answers".* FROM "question_and_answers" WHERE "question_and_answers"."quiz_id" = ?  [["quiz_id", 2]]
---
  def correct_answers
  	self.question_and_answers.collect{|qa| qa.answer}