app/models/quiz.rb

	def categories_attributes=(category_attributes)
    category_attributes.values.each do |category_attribute|

      if category_attribute[:name] != ""
        category = Category.find_or_create_by(category_attribute)
        self.categories << category
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "sfdsdfdf"], ["created_at", "2018-10-13 21:37:43.600765"], ["updated_at", "2018-10-13 21:37:43.600765"]]
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "animals"], ["created_at", "2018-10-14 20:59:22.630371"], ["updated_at", "2018-10-14 20:59:22.630371"]]

  def correct_answers
  	self.question_and_answers.collect{|qa| qa.answer}
---
SELECT "question_and_answers".* FROM "question_and_answers" WHERE "question_and_answers"."quiz_id" = ?  [["quiz_id", 4]]