app/views/layouts/application.html.erb

SELECT "categories".* FROM "categories"
---
                 <%= form_tag("/quizzes/categories/:id", method: "get") do %>
                   <%= select_tag "category", options_from_collection_for_select(Category.all, "name", "name"), include_blank: "Find Quiz by Category" %>